[
  {
    "Quantum Optical Control of Semiconductor Nanostructures":{
      "bg":"quan-opt-bg.jpeg",
      "text":"Semiconductor nanostructures such as quantum dots (QDs) have offered researchers unique opportunities to investigate sophisticated quantum optical effects in solid-state systems. These effects include quantum interference, Rabi oscillations, and photon antibunching, and were previously only observable in isolated atoms or ions.  QDs can be readily integrated into optical microcavities, making them attractive for a number of applications, including particularly quantum information processing and high efficiency quantum light sources.  One of the key issues in this area of research is the ability to coherently control solid-state quantum emitters.  Successful implementation of coherent controls will open the way to new applications of quantum information science. \nOur group has recently made significant progress in this endeavor.  In particular, we have shown that resonantly controlled light emissions of quantum dots in a cavity can indeed be achieved.  Shown in Fig. 2 is an example of resonant control of quantum emitters in the non-linear regime.  In particular, when driven resonantly with the driving Rabi frequency exceeding subtantially the natural line width, the quantum emitter undergoes many Rabi cycles before emitting single photons.  The quantum states involved become dressed states, resulting in well-defined side bands for the emitted spectrum (so-called Mollow triplets).  This can be observed in the left panel, where the energy separation of the side bands is directly proportional to the driving field strength. \nAlso shown, in the right panel of Fig. 2, is the measured second order photon-photon correlation, g(2)(t), when the quantum emitters are coherently driven.  In this case, g(2)(t) represents the probably of observing the second photon at time t after observing the first. Since the emission of the first photon initializes a quantum bit,  g(2)(t) therefore presents the dynamic quantum information of the matter qubits (after initialization) being projected to the photons.",
      "img":[
        {
          "name":"quan-opt-fig1.jpg",
          "subtitle":"Fig. 1 Quantum emitters being confined in a micro-cavity.  The spatial distribution of cavity modes are directly imaged",
          "link":"https://pubs.acs.org/doi/abs/10.1021/nl0622909",
          "text":"[Nano Letters 6, 2920 (2006)]"
        },
        {
          "name":"quan-opt-fig2.jpg",
          "subtitle":"Mollow triplets and second order photon correlations for quantum emitters under resonant excitations",
          "link":"https://www.nature.com/articles/nphys1184",
          "text":"[Nature Physics 5, 203 (2009)]"
        }
      ]
    }
  },
  {
    "Quantum Engineering of Metallic Thin Film Structures":{
      "bg":"quan-eng-bg.jpeg",
      "text":"When an electronic system is confined in one or more dimensions to a length scale comparable to the de Broglie length, quantum confinement occurs.  Such confinements have played a central role in artificially engineered electronic systems such as quantum wells, wires, dots and related superlattices. For semiconductors, quantum confinement can occur at length scales between 100 and 10 nm.  For metals, however, quantum confinement becomes important at length scales from a few nm down to the sub-nanometer regime.  It has been known for some time that quantum well states (QWS) can contribute to  interesting physical properties such as magnetism.  More recently, our group and others have discovered that QWS can profoundly influence the epitaxial growth of metallic films; this phenomenon has been dubbed “electronic” growth or “quantum” growth.\nSince making this initial discovery, our group has continued to explore the role of quantum confinement in the physical and chemical properties of ultra-thin metallic films.  Recent efforts have been focused on three areas: (a) quantum size effects on surface energy, which is directly relevant to quantum size effects on the growth of ultra-thin metallic films; (b) quantum size effects on work function, which has a strong bearing on surface chemistry; and (c) superconductivity, where the interplay of quantum confinement and superfluidity stiffness at the nanometer length scale give rise to intriguing phenomena.\nOne example of this is the group’s recent observation of robust superconductivity in the extreme 2D limit.  Shown in the above figure is the STM image of a thin superconducting Pb film only two atomic layers thick, grown epitaxially on a Si substrate.  The film is atomically flat: the steps observed on the surface are due to the atomic steps of the substrate.  In such a two-atomic layer film, there exists only one transverse channel, due to the quantum confinement of the electronic system; thus, this system represents the ultimate two-dimensional limit of a thin film superconductor. Most surprisingly, its superconductivity is robust, with a Tc at 70% of its bulk value.  This is beyond the expectation of the conventional understanding of 2D superconductivity.\nShih’s group has recently pushed this line of research into creating nanoscale superconductor heterostructures, and has discovered that in some cases the well-established Ginzberg-Landau theory completely fails to describe induced superconductivity due to proximity effects. ",
      "img":[
        {
          "name":"quan-eng-fig1.jpg",
          "subtitle":"STM image of a 2 ML Pb film epitaxially grown on Si(111) substrate The superconductivity is probed using tunneling spectroscopy to resolved the superconducting gap",
          "link":"http://science.sciencemag.org/content/324/5932/1314",
          "text":"[Science 324, 1314 (2009)]"
        }
      ]
    }
  },
  {
    "Atomically Smooth Epitaxial Metallic Films on Silicon as a Platform for Plasmonics":{
      "bg":"atom-smo-bg.jpeg",
      "text":"The ability to create atomically smooth metallic films on semiconductor surfaces allows us to venture into another current topics of condesed matter physics:  plasmonics. \nSurface plasmon polaritons (SPPs) are spatially-confined electromagnetic waves propagating along a metal/dielectric interface. \nBecause of their ability to carry optical signals at subwavelength scales, SPPs have been proposed as a solution to the important problem of integrating nanoscale electronics with wavelength-scale photonics. However, despite an enormous amount of fascinating plasmonics research, technological applications critically depend on increasing SPP propagation length and on integrating plasmonic structures with electronic components that are mostly Si-based. \nThe Shih Group and its collaborators have recently demonstrated that atomically smooth, epitaxial Ag films on Si support extremely low-damped SPPs on both sides of the metal film. Using angle-resolved infrared spectroscopy, we have probed the coherent propagation of long-range SPPs by employing the phenomenon of extraordinary optical transmission (EOT), and have discovered detailed SPP band structures (see figure).  By comparing EOT data from epitaxial and conventional polycrystalline films, we have revealed the dramatic advantages of the former platform for plasmonics studies and technological application. \nShown in Fig. (a) are experimentally measured angle-dependent mid-infrared transmission spectra of air/Ag/Si under TM-polarized illumination for a perforated epitaxial Ag film.  Fig. (b) shows a theoretical simulation of the same transimission spectra, carried out by Professor Gennady Shvet’s group.  In analogy to the electronic band structures in a periodic lattice, here the SPPs undergo coherent Bragg scattering due to the periodic hole array, resulting in rich plasmonic band structures.  The most signficant result is that high-Q SPP propagation is observed both at the Ag/Si interface and at the Ag/Air interface.  These results open a new door toward monolithic integration of plasmonics and electronics on the same platform, using atomically smooth epitaxial Ag films on Si.",
      "img":[
        {
          "name":"atom-smo-fig1.jpg",
          "subtitle":"Angle-resolved transmission spectra for a  perforated epitaxial Ag films on Si.",
          "link":"",
          "text":""
        }
      ]
    }
  }
]
